artillery.yml
config:
  target: "http://ec2-13-56-181-115.us-west-1.compute.amazonaws.com:3009"
  phases:
  - duration: 20
    arrivalRate: 1
    name: "Warm up the application"
  - duration: 20
    arrivalRate: 1
    rampTo: 200
    name: "jump to max load"
  - duration: 60
    arrivalRate: 200
    name: "keep at the max load"
  - duration: 20
    arrivalRate: 200
    rampTo: 1
    name: "calm down"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
 
scenarios:
    - flow:
        - loop:
            - get:
                url: "/{{$randomNumber(0, 99999)}}"
          count: 5